#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: f79e0f451225221a968d3b90cc06f422.pdb
; shader hash: f79e0f451225221a968d3b90cc06f422
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer GenerateMipsCB
; {
;
;   struct GenerateMipsCB
;   {
;
;       uint SrcMipLevel;                             ; Offset:    0
;       uint NumMipLevels;                            ; Offset:    4
;       uint SrcDimension;                            ; Offset:    8
;       bool IsSRGB;                                  ; Offset:   12
;       float2 TexelSize;                             ; Offset:   16
;   
;   } GenerateMipsCB;                                 ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; GenerateMipsCB                    cbuffer      NA          NA     CB0            cb0     1
; LinearClampSampler                sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !64)
!1 = !DIFile(filename: "Src\5CRHI\5CSrc\5CRHI\5CGenerateMips_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 112, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 112, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 112, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 112, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 131, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 131, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 131, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 131, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24, !45, !48, !58, !61}
!24 = !DISubprogram(name: "main", scope: !25, file: !25, line: 110, type: !26, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DIFile(filename: "Src\5CRHI\5CGenerateMips_CS.hlsl", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28}
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !25, line: 21, size: 320, align: 32, elements: !29)
!29 = !{!30, !41, !42, !43}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !28, file: !25, line: 23, baseType: !31, size: 96, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 67, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 67, size: 96, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 67, baseType: !35, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 67, baseType: !35, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 67, baseType: !35, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !{!39, !40}
!39 = !DITemplateTypeParameter(name: "element", type: !35)
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !28, file: !25, line: 24, baseType: !31, size: 96, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !28, file: !25, line: 25, baseType: !31, size: 96, align: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !28, file: !25, line: 26, baseType: !44, size: 32, align: 32, offset: 288)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 67, baseType: !35)
!45 = !DISubprogram(name: "PackColor", linkageName: "\01?PackColor@@YA?AV?$vector@M$03@@V1@@Z", scope: !25, file: !25, line: 96, type: !46, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!4, !4}
!48 = !DISubprogram(name: "ConvertToSRGB", linkageName: "\01?ConvertToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !25, file: !25, line: 89, type: !49, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 106, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 106, size: 96, align: 32, elements: !53, templateParams: !57)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 106, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, line: 106, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !{!13, !40}
!58 = !DISubprogram(name: "StoreColor", linkageName: "\01?StoreColor@@YAXIV?$vector@M$03@@@Z", scope: !25, file: !25, line: 69, type: !59, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !44, !4}
!61 = !DISubprogram(name: "LoadColor", linkageName: "\01?LoadColor@@YA?AV?$vector@M$03@@I@Z", scope: !25, file: !25, line: 77, type: !62, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!4, !44}
!64 = !{!65, !69, !70, !71, !72, !76, !78, !79, !80, !81}
!65 = !DIGlobalVariable(name: "gs_R", linkageName: "\01?gs_R@@3PAMA", scope: !0, file: !25, line: 64, type: !66, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_R@@3PAMA")
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, align: 32, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 64)
!69 = !DIGlobalVariable(name: "gs_G", linkageName: "\01?gs_G@@3PAMA", scope: !0, file: !25, line: 65, type: !66, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_G@@3PAMA")
!70 = !DIGlobalVariable(name: "gs_B", linkageName: "\01?gs_B@@3PAMA", scope: !0, file: !25, line: 66, type: !66, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_B@@3PAMA")
!71 = !DIGlobalVariable(name: "gs_A", linkageName: "\01?gs_A@@3PAMA", scope: !0, file: !25, line: 67, type: !66, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?gs_A@@3PAMA")
!72 = !DIGlobalVariable(name: "SrcMip", linkageName: "\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 39, type: !73, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?SrcMip@@3V?$Texture2D@V?$vector@M$03@@@@A")
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 39, size: 160, align: 32, elements: !2, templateParams: !74)
!74 = !{!75}
!75 = !DITemplateTypeParameter(name: "element", type: !5)
!76 = !DIGlobalVariable(name: "OutMip1", linkageName: "\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 42, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?OutMip1@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 42, size: 128, align: 32, elements: !2, templateParams: !74)
!78 = !DIGlobalVariable(name: "OutMip2", linkageName: "\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 43, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?OutMip2@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!79 = !DIGlobalVariable(name: "OutMip3", linkageName: "\01?OutMip3@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 44, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?OutMip3@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!80 = !DIGlobalVariable(name: "OutMip4", linkageName: "\01?OutMip4@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !25, line: 45, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?OutMip4@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!81 = !DIGlobalVariable(name: "LinearClampSampler", linkageName: "\01?LinearClampSampler@@3USamplerState@@A", scope: !0, file: !25, line: 48, type: !82, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearClampSampler@@3USamplerState@@A")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 48, size: 32, align: 32, elements: !2)
