#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 12678137c995e9441b653513f93bed62.pdb
; shader hash: 12678137c995e9441b653513f93bed62
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer PanoToCubemapCB
; {
;
;   struct PanoToCubemapCB
;   {
;
;       struct struct.PanoToCubemap
;       {
;
;           uint CubemapSize;                         ; Offset:    0
;           uint FirstMip;                            ; Offset:    4
;           uint NumMips;                             ; Offset:    8
;       
;       } PanoToCubemapCB;                            ; Offset:    0
;
;   
;   } PanoToCubemapCB;                                ; Offset:    0 Size:    12
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; PanoToCubemapCB                   cbuffer      NA          NA     CB0            cb0     1
; LinearRepeatSampler               sampler      NA          NA      S0             s0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !46, globals: !63)
!1 = !DIFile(filename: "Src\5CRHI\5CSrc\5CRHI\5CPanoToCubemap_CS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !15, !22, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 98, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 98, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 98, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 105, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 105, size: 64, align: 32, elements: !17, templateParams: !20)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 105, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 105, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!12, !21}
!21 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!30, !13}
!30 = !DITemplateTypeParameter(name: "element", type: !26)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 61, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 61, size: 288, align: 32, elements: !33, templateParams: !43)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !32, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!43 = !{!12, !44, !45}
!44 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!45 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!46 = !{!47, !58, !61}
!47 = !DISubprogram(name: "main", scope: !48, file: !48, line: 88, type: !49, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!48 = !DIFile(filename: "Src\5CRHI\5CPanoToCubemap_CS.hlsl", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "ComputeShaderInput", file: !48, line: 7, size: 320, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "GroupID", scope: !51, file: !48, line: 9, baseType: !22, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GroupThreadID", scope: !51, file: !48, line: 10, baseType: !22, size: 96, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "DispatchThreadID", scope: !51, file: !48, line: 11, baseType: !22, size: 96, align: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "GroupIndex", scope: !51, file: !48, line: 12, baseType: !57, size: 32, align: 32, offset: 288)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !26)
!58 = !DISubprogram(name: "??__ERotateUV@@YAXXZ", scope: !48, file: !48, line: 59, type: !59, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DISubprogram(linkageName: "_GLOBAL__sub_I_PanoToCubemap_CS.hlsl", scope: !1, file: !1, type: !62, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!62 = !DISubroutineType(types: !2)
!63 = !{!64, !76, !78, !79, !80, !81, !82, !84, !86, !87, !89, !91, !93}
!64 = !DIGlobalVariable(name: "SrcTexture", linkageName: "\01?SrcTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 29, type: !65, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?SrcTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 29, size: 160, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !68)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 29, size: 128, align: 32, elements: !69, templateParams: !74)
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !68, file: !1, line: 29, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !68, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !68, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!74 = !{!12, !75}
!75 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!76 = !DIGlobalVariable(name: "DstMip1", linkageName: "\01?DstMip1@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 32, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2DArray<vector<float, 4> >"* @"\01?DstMip1@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A")
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2DArray<vector<float, 4> >", file: !1, line: 32, size: 128, align: 32, elements: !2, templateParams: !66)
!78 = !DIGlobalVariable(name: "DstMip2", linkageName: "\01?DstMip2@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 33, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2DArray<vector<float, 4> >"* @"\01?DstMip2@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A")
!79 = !DIGlobalVariable(name: "DstMip3", linkageName: "\01?DstMip3@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 34, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2DArray<vector<float, 4> >"* @"\01?DstMip3@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A")
!80 = !DIGlobalVariable(name: "DstMip4", linkageName: "\01?DstMip4@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 35, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2DArray<vector<float, 4> >"* @"\01?DstMip4@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A")
!81 = !DIGlobalVariable(name: "DstMip5", linkageName: "\01?DstMip5@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A", scope: !0, file: !48, line: 36, type: !77, isLocal: false, isDefinition: true, variable: %"class.RWTexture2DArray<vector<float, 4> >"* @"\01?DstMip5@@3V?$RWTexture2DArray@V?$vector@M$03@@@@A")
!82 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !48, line: 39, type: !83, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearRepeatSampler@@3USamplerState@@A")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 39, size: 32, align: 32, elements: !2)
!84 = !DIGlobalVariable(name: "InvPI", scope: !0, file: !48, line: 54, type: !85, isLocal: true, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!86 = !DIGlobalVariable(name: "Inv2PI", scope: !0, file: !48, line: 55, type: !85, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariable(name: "InvAtan", scope: !0, file: !48, line: 56, type: !88, isLocal: true, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!89 = !DIGlobalVariable(name: "InvAtan.0", linkageName: "InvAtan.0", scope: !0, file: !48, line: 56, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !88, size: 32, align: 4)
!91 = !DIGlobalVariable(name: "InvAtan.1", linkageName: "InvAtan.1", scope: !0, file: !48, line: 56, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !88, size: 32, align: 4, offset: 32)
!93 = !DIGlobalVariable(name: "RotateUV", linkageName: "RotateUV.v.v.1dim", scope: !0, file: !48, line: 59, type: !94, isLocal: false, isDefinition: true, variable: [54 x float]* @RotateUV.v.v.1dim)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1728, align: 32, elements: !96)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!96 = !{!97}
!97 = !DISubrange(count: 6)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{!"dxc 1.2"}
